MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX460F256L.PIC
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="OC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="OC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="OC4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="RD12"/>
      <edc:VirtualPin edc:name="PMD12"/>
      <edc:VirtualPin edc:name="IC5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 80-->
      <edc:VirtualPin edc:name="RD13"/>
      <edc:VirtualPin edc:name="CN19"/>
      <edc:VirtualPin edc:name="PMD13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 81-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="OC5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 82-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="PMRD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 83-->
      <edc:VirtualPin edc:name="RD6"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="PMD14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 84-->
      <edc:VirtualPin edc:name="RD7"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="PMD15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 85-->
      <edc:VirtualPin edc:name="VCORE"/>
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 86-->
      <edc:VirtualPin edc:name="ENVREG"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 87-->
      <edc:VirtualPin edc:name="RF0"/>
      <edc:VirtualPin edc:name="PMD11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 88-->
      <edc:VirtualPin edc:name="RF1"/>
      <edc:VirtualPin edc:name="PMD10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 89-->
      <edc:VirtualPin edc:name="RG1"/>
      <edc:VirtualPin edc:name="PMD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 90-->
      <edc:VirtualPin edc:name="RG0"/>
      <edc:VirtualPin edc:name="PMD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 91-->
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="TRCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 92-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="TRD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 93-->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="PMD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 94-->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="PMD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 95-->
      <edc:VirtualPin edc:name="RG14"/>
      <edc:VirtualPin edc:name="TRD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 96-->
      <edc:VirtualPin edc:name="RG12"/>
      <edc:VirtualPin edc:name="TRD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 97-->
      <edc:VirtualPin edc:name="RG13"/>
      <edc:VirtualPin edc:name="TRD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 98-->
      <edc:VirtualPin edc:name="RE2"/>
      <edc:VirtualPin edc:name="PMD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 99-->
      <edc:VirtualPin edc:name="RE3"/>
      <edc:VirtualPin edc:name="PMD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 100-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="PMD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 101-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 102-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 103-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 104-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 105-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 106-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 107-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 108-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 109-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 110-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 111-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 112-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 113-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 114-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 115-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 116-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 117-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 118-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 119-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 120-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 121-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
